# 한줄 주석
#변수----------------------
# value = 100
# print(value)
# value = 200
# print(value)
# value = 'Hello'
# print(value)

#데이터 타입-----------------------------------------------------
# print(type(100))
# print(type("hello"))

#--------------------------------------------------------
# width = 10
# height = 20
# print('사각형의 넓이는',width*height,'이다')

#수치형 데이터-정수형--------------------------------------------------------
# radius = 5
# PI = 3.14
# area = radius*radius*PI
# print("원의 넓이는 ",area,'이다')

#문자열--------------------------------------
#print(type('a'))
# print('A')
# print('B')
# print(ord('A'))
# print(ord('B'))
# print(chr(65))
# print(chr(66))
# print(chr(97))
# print(chr(98))

# #문자열 데이터-여러줄출력법---------------------------------------------------------------------------------
# print('개행문자를 사용하지 않는 경우')
# print('죽는 날까지 하늘을 우러러 한 점 부끄럼이 없기를 잎새에 이는 바람에도 나는 괴로워 했다')
# print('개행문자를 사용한 경우')
# print('죽는 날까지 하늘을 우러러\n 한 점 부끄럼이 없기를\n 잎새에 이는 바람에도\n 나는 괴로워 했다')

#문자열 데이터 따옴표------------------------------------------------------------
#print('She's gone.')  에러남 작은 따옴표 앞에 것만 인식
# print("She's gone.")
# print('She said "goodbye."')

#input()--------------------------------------------------------------------
# strValue = input('좋아하는 과일은 무엇인가요?')
# print(strValue+'을 좋아합니다')

#input() 두번 사용--------------------------------------------------------------------
# strID = input('아이디를 입력하세요')
# strPW = input('비밀번호를 입력하세요')
# print('입력한 ID는'+strID+'입니다')
# print('입력한 PW는'+strPW+'입니다')

#input() 두번 사용--------------------------------------------------------------------
# strNum1 = input('첫번째 숫자를 입력하세요')
# strNum2 = input('두번째 숫자를 입력하세요')
# print('두 수의 합은'+strNum1+strNum2+'입니다')

#타입캐스팅-------------------------------------------------------------
# a = int('100')
# b = int(3.14)
# print(a + b)

# c = str(100)
# d = str(3.14)
# print(c + d)

# #input()--------------------------------------------------------------------
# strNum1 = input('첫번째 숫자를 입력하세요:')
# strNum2 = input('두번째 숫자를 입력하세요:')
# total = int(strNum1)+ int(strNum2)
# print('두 수의 합은'+str(total)+'입니다')

#주석사용---------------------------------------------------
'''
fruit1 = '수박,'
fruit2 = '포도,'
fruit3 = '키위'
myfavorite =''
"""
주석
myfavorite += fruit1
myfavorite += fruit2
"""
myfavorite += fruit3
print('내가 좋아하는 과일은:'+myfavorite+'입니다')

주석
'''
#-------------------------------------------------------------------
